/*Вам надано масив (який матиме довжину принаймні 3, але може бути дуже великим), що містить цілі числа.
 Масив або повністю складається з непарних цілих чисел, або повністю складається з парних цілих чисел, за винятком одного цілого числа N. 
 Напишіть метод, який приймає масив як аргумент і повертає цей «викид» N. */
 const findOutlier = (integers) => {
    const even = integers.filter(n => n%2===0);
    const odd = integers.filter(n => n%2 !==0);

    return even.length===1 ? even[0] : odd[0];
};

console.log(findOutlier([160, 3, 1719, 19, 11, 13, -21]));